Xinyuan-LilyGO/LilyGoLib/arduino/temporary_tdeck/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

##############################################################
# Temporary board definition for the original LILYGO T-Deck. #
# Remove this package after T-Deck support is released by     #
# Arduino-ESP32.                                               #
##############################################################

lilygo_tdeck.name=LilyGo T-Deck

lilygo_tdeck.bootloader.tool=esp32:esptool_py
lilygo_tdeck.bootloader.tool.default=esp32:esptool_py

lilygo_tdeck.upload.tool=esp32:esptool_py
lilygo_tdeck.upload.tool.default=esp32:esptool_py
lilygo_tdeck.upload.tool.network=esp32:esp_ota

lilygo_tdeck.upload.maximum_size=1310720
lilygo_tdeck.upload.maximum_data_size=327680
lilygo_tdeck.upload.flags=
lilygo_tdeck.upload.erase_cmd=
lilygo_tdeck.upload.extra_flags=
lilygo_tdeck.upload.use_1200bps_touch=false
lilygo_tdeck.upload.wait_for_upload_port=false

lilygo_tdeck.serial.disableDTR=false
lilygo_tdeck.serial.disableRTS=false

lilygo_tdeck.build.tarch=xtensa
lilygo_tdeck.build.bootloader_addr=0x0
lilygo_tdeck.build.target=esp32s3
lilygo_tdeck.build.mcu=esp32s3
lilygo_tdeck.build.core=esp32:esp32
lilygo_tdeck.build.variant=lilygo_tdeck
lilygo_tdeck.build.board=LILYGO_T_DECK
lilygo_tdeck.runtime.use_core_platform_path_for_runtime_platform_path=true

lilygo_tdeck.build.usb_mode=1
lilygo_tdeck.build.cdc_on_boot=0
lilygo_tdeck.build.msc_on_boot=0
lilygo_tdeck.build.dfu_on_boot=0
lilygo_tdeck.build.f_cpu=240000000L
lilygo_tdeck.build.flash_size=16MB
lilygo_tdeck.build.flash_freq=80m
lilygo_tdeck.build.flash_mode=dio
lilygo_tdeck.build.boot=qio
lilygo_tdeck.build.boot_freq=80m
lilygo_tdeck.build.partitions=app3M_fat9M_16MB
lilygo_tdeck.build.defines=-DBOARD_HAS_PSRAM -DARDUINO_T_DECK -DARDUINO_LILYGO_LORA_SX1262
lilygo_tdeck.build.loop_core=
lilygo_tdeck.build.event_core=
lilygo_tdeck.build.psram_type=opi
lilygo_tdeck.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
lilygo_tdeck.menu.JTAGAdapter.default=Disabled
lilygo_tdeck.menu.JTAGAdapter.default.build.copy_jtag_files=0
lilygo_tdeck.menu.JTAGAdapter.builtin=Integrated USB JTAG
lilygo_tdeck.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
lilygo_tdeck.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

lilygo_tdeck.menu.LoopCore.1=Core 1
lilygo_tdeck.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
lilygo_tdeck.menu.LoopCore.0=Core 0
lilygo_tdeck.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

lilygo_tdeck.menu.EventsCore.1=Core 1
lilygo_tdeck.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lilygo_tdeck.menu.EventsCore.0=Core 0
lilygo_tdeck.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lilygo_tdeck.menu.USBMode.hwcdc=Hardware CDC and JTAG
lilygo_tdeck.menu.USBMode.hwcdc.build.usb_mode=1
lilygo_tdeck.menu.USBMode.default=USB-OTG (TinyUSB)
lilygo_tdeck.menu.USBMode.default.build.usb_mode=0

lilygo_tdeck.menu.CDCOnBoot.default=Enabled
lilygo_tdeck.menu.CDCOnBoot.default.build.cdc_on_boot=1
lilygo_tdeck.menu.CDCOnBoot.cdc=Disabled
lilygo_tdeck.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

lilygo_tdeck.menu.MSCOnBoot.default=Disabled
lilygo_tdeck.menu.MSCOnBoot.default.build.msc_on_boot=0
lilygo_tdeck.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lilygo_tdeck.menu.MSCOnBoot.msc.build.msc_on_boot=1

lilygo_tdeck.menu.DFUOnBoot.default=Disabled
lilygo_tdeck.menu.DFUOnBoot.default.build.dfu_on_boot=0
lilygo_tdeck.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lilygo_tdeck.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lilygo_tdeck.menu.UploadMode.default=UART0 / Hardware CDC
lilygo_tdeck.menu.UploadMode.default.upload.use_1200bps_touch=false
lilygo_tdeck.menu.UploadMode.default.upload.wait_for_upload_port=false
lilygo_tdeck.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lilygo_tdeck.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lilygo_tdeck.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lilygo_tdeck.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lilygo_tdeck.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lilygo_tdeck.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lilygo_tdeck.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
lilygo_tdeck.menu.PartitionScheme.fatflash.build.partitions=ffat
lilygo_tdeck.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
lilygo_tdeck.menu.PartitionScheme.rainmaker=RainMaker
lilygo_tdeck.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lilygo_tdeck.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
lilygo_tdeck.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/6MB SPIFFS/3.9MB MODEL)
lilygo_tdeck.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
lilygo_tdeck.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xC10000 {build.path}/srmodels.bin
lilygo_tdeck.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
lilygo_tdeck.menu.PartitionScheme.custom=Custom
lilygo_tdeck.menu.PartitionScheme.custom.build.partitions=
lilygo_tdeck.menu.PartitionScheme.custom.upload.maximum_size=16777216

lilygo_tdeck.menu.CPUFreq.240=240MHz (WiFi)
lilygo_tdeck.menu.CPUFreq.240.build.f_cpu=240000000L
lilygo_tdeck.menu.CPUFreq.160=160MHz (WiFi)
lilygo_tdeck.menu.CPUFreq.160.build.f_cpu=160000000L
lilygo_tdeck.menu.CPUFreq.80=80MHz (WiFi)
lilygo_tdeck.menu.CPUFreq.80.build.f_cpu=80000000L
lilygo_tdeck.menu.CPUFreq.40=40MHz
lilygo_tdeck.menu.CPUFreq.40.build.f_cpu=40000000L
lilygo_tdeck.menu.CPUFreq.20=20MHz
lilygo_tdeck.menu.CPUFreq.20.build.f_cpu=20000000L
lilygo_tdeck.menu.CPUFreq.10=10MHz
lilygo_tdeck.menu.CPUFreq.10.build.f_cpu=10000000L

lilygo_tdeck.menu.UploadSpeed.921600=921600
lilygo_tdeck.menu.UploadSpeed.921600.upload.speed=921600
lilygo_tdeck.menu.UploadSpeed.115200=115200
lilygo_tdeck.menu.UploadSpeed.115200.upload.speed=115200
lilygo_tdeck.menu.UploadSpeed.256000.windows=256000
lilygo_tdeck.menu.UploadSpeed.256000.upload.speed=256000
lilygo_tdeck.menu.UploadSpeed.230400.windows.upload.speed=256000
lilygo_tdeck.menu.UploadSpeed.230400=230400
lilygo_tdeck.menu.UploadSpeed.230400.upload.speed=230400
lilygo_tdeck.menu.UploadSpeed.460800.linux=460800
lilygo_tdeck.menu.UploadSpeed.460800.macosx=460800
lilygo_tdeck.menu.UploadSpeed.460800.upload.speed=460800
lilygo_tdeck.menu.UploadSpeed.512000.windows=512000
lilygo_tdeck.menu.UploadSpeed.512000.upload.speed=512000

lilygo_tdeck.menu.DebugLevel.none=None
lilygo_tdeck.menu.DebugLevel.none.build.code_debug=0
lilygo_tdeck.menu.DebugLevel.error=Error
lilygo_tdeck.menu.DebugLevel.error.build.code_debug=1
lilygo_tdeck.menu.DebugLevel.warn=Warn
lilygo_tdeck.menu.DebugLevel.warn.build.code_debug=2
lilygo_tdeck.menu.DebugLevel.info=Info
lilygo_tdeck.menu.DebugLevel.info.build.code_debug=3
lilygo_tdeck.menu.DebugLevel.debug=Debug
lilygo_tdeck.menu.DebugLevel.debug.build.code_debug=4
lilygo_tdeck.menu.DebugLevel.verbose=Verbose
lilygo_tdeck.menu.DebugLevel.verbose.build.code_debug=5

lilygo_tdeck.menu.EraseFlash.none=Disabled
lilygo_tdeck.menu.EraseFlash.all=Enabled
lilygo_tdeck.menu.EraseFlash.all.upload.erase_cmd=-e
